[
    {
        "title": "NASA's Perseverance Rover Bringing 3D-Printed Metal Parts to Mars",
        "preview": "For hobbyists and makers, 3D printing expands creative possibilities; for specialized engineers, it's also key to next-generation spacecraft design."
    },
    {
        "title": "Heat and Dust Help Launch Martian Water Into Space, Scientists Find",
        "preview": "Scientists using an instrument aboard NASA’s Mars Atmosphere and Volatile EvolutioN, or MAVEN, spacecraft have discovered that water vapor near the surface of the Red Planet is lofted higher into the atmosphere than anyone expected was possible. "
    },
    {
        "title": "Mars Helicopter Attached to NASA's Perseverance Rover",
        "preview": "The team also fueled the rover's sky crane to get ready for this summer's history-making launch."
    },
    {
        "title": "The Extraordinary Sample-Gathering System of NASA's Perseverance Mars Rover",
        "preview": "Two astronauts collected Moon rocks on Apollo 11. It will take three robotic systems working together to gather up the first Mars rock samples for return to Earth."
    },
    {
        "title": "How NASA's Mars Helicopter Will Reach the Red Planet's Surface",
        "preview": "The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."
    },
    {
        "title": "The Launch Is Approaching for NASA's Next Mars Rover, Perseverance",
        "preview": "The Red Planet's surface has been visited by eight NASA spacecraft. The ninth will be the first that includes a roundtrip ticket in its flight plan. "
    },
    {
        "title": "Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest",
        "preview": "Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite. "
    },
    {
        "title": "NASA's Mars Perseverance Rover Passes Flight Readiness Review",
        "preview": "​The agency's Mars 2020 mission has one more big prelaunch review – the Launch Readiness Review, on July 27."
    },
    {
        "title": "Space History Is Made in This NASA Robot Factory",
        "preview": "From rockets to rovers, JPL's Spacecraft Assembly Facility has been at the center of robotic spaceflight. Here's a closer look at what makes it so special."
    },
    {
        "title": "NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network",
        "preview": "Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."
    },
    {
        "title": "NASA's Curiosity Rover Finds an Ancient Oasis on Mars",
        "preview": "New evidence suggests salty, shallow ponds once dotted a Martian crater — a sign of the planet's drying climate."
    },
    {
        "title": "Join NASA for the Launch of the Mars 2020 Perseverance Rover",
        "preview": "No matter where you live, choose from a menu of activities to join NASA as we \"Countdown to Mars\" and launch the Perseverance rover to the Red Planet."
    },
    {
        "title": "New Selfie Shows Curiosity, the Mars Chemist",
        "preview": "The NASA rover performed a special chemistry experiment at the location captured in its newest self-portrait."
    },
    {
        "title": "Mars Scientists Investigate Ancient Life in Australia",
        "preview": "Teams with NASA's Mars 2020 and ESA's ExoMars practiced hunting for fossilized microbial life in the Australian Outback in preparation for their Red Planet missions. "
    },
    {
        "title": "NASA Adds Return Sample Scientists to Mars 2020 Leadership Team",
        "preview": "The leadership council for Mars 2020 science added two new members who represent the interests of scientists destined to handle and study the first samples from Red Planet."
    }
]